cases/catalyticSimpleFOAM_v0.1/Case01/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         reactingMixture;
    transport       sutherland;
    thermo          janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}

inertSpecie AR;

chemistryReader chemkinReader;

CHEMKINFile     "$FOAM_CASE/chemkin/chem.inp";

CHEMKINThermoFile "$FOAM_CASE/chemkin/therm.dat";

homogeneousReactions off;
heterogeneousReactions on;
massDiffusionInEnergyEquation off;
soretEffect off;

relTolerance			1e-7;
absTolerance			1e-12;


spark 		off;
position    	(5e-3 0 5e-3);
time		0;
temperature 	2500;
duration 	2e-3;
diameter 	20e-3;



// ************************************************************************* //
